Autodesk.Revit.DB.Path3d.CurveLoop(System.Int32)
Get the Curve Loop of Path3d via index.
Remarks: Returns the index order Curve Loop of Path3d.

Autodesk.Revit.DB.Path3d.AllCurveLoops
Get all the Curve Loops of Path3d.
Remarks: Returns all the Curve Loops of Path3d.

Autodesk.Revit.DB.Path3d.NumCurveLoops
Get the Number of Curve Loops of Path3d.
Remarks: Returns the Number of Curve Loops of Path3d.

Autodesk.Revit.DB.Path3d
Provides access to the Generic 3D path object in Autodesk Revit.
Remarks: This object represents a 3D path sketch of Sweep.